Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.CreateNodeIfNeeded(Tekla.Structures.Catalogs.RebarItem,System.Int32)
Creates new nodes in the tree for Grades and Usages of the rebar
Item: RebarItem that is going to be added to the tree if needed
NodeType: Node type that is going to be added